first_routes/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "derik"], ["email", "lizbot@gmail.com"], ["created_at", "2022-11-10 00:55:17.582641"], ["updated_at", "2022-11-10 00:55:17.582641"]]

    def show
        user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]

    def update
        user = User.find_by(id: params[:id])

        if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "superman"], ["email", "superpower@gmail.com"], ["updated_at", "2022-11-10 01:21:12.272093"], ["id", 2]]

    def destroy
        user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]